Kai5erzz/knexus_driver_module/stm32/knexus_st/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32h7xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define KEY0_Pin GPIO_PIN_3
#define KEY0_GPIO_Port GPIOE
#define TRACK_ADC_Pin GPIO_PIN_5
#define TRACK_ADC_GPIO_Port GPIOC
#define MOTOR1_PHASE_Pin GPIO_PIN_0
#define MOTOR1_PHASE_GPIO_Port GPIOB
#define MOTOR2_PHASE_Pin GPIO_PIN_11
#define MOTOR2_PHASE_GPIO_Port GPIOB
#define LED0_Pin GPIO_PIN_7
#define LED0_GPIO_Port GPIOH
#define SPI_BMI088_CS0_Pin GPIO_PIN_8
#define SPI_BMI088_CS0_GPIO_Port GPIOH
#define BEEP_Pin GPIO_PIN_10
#define BEEP_GPIO_Port GPIOA
#define SPI_BMI088_CS1_Pin GPIO_PIN_3
#define SPI_BMI088_CS1_GPIO_Port GPIOI
#define LED1_Pin GPIO_PIN_3
#define LED1_GPIO_Port GPIOD
#define LED2_Pin GPIO_PIN_4
#define LED2_GPIO_Port GPIOD
#define KEY1_Pin GPIO_PIN_10
#define KEY1_GPIO_Port GPIOG
#define TRACK_AD0_Pin GPIO_PIN_4
#define TRACK_AD0_GPIO_Port GPIOB
#define TRACK_AD1_Pin GPIO_PIN_5
#define TRACK_AD1_GPIO_Port GPIOB
#define TRACK_AD2_Pin GPIO_PIN_7
#define TRACK_AD2_GPIO_Port GPIOB

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
